In [ ]:
#create a list of containing 5 subjects to convert the list to panda series

In [3]:
import pandas as pd

subjects = ['Mathematics', 'English', 'Biology', 'History', 'Computer Science']

series = pd.Series(subjects)

print(series)

0         Mathematics
1             English
2             Biology
3             History
4    Computer Science
dtype: object

In [ ]:
# 1 dimensional array containing heterogenous type

In [ ]:
#create a list of containing 5 subjects to convert the list to panda series 2 dimensional aarray

In [ ]:
#create a dictionary for students and pass roll number of 5 students and cgpa of 5 students

In [13]:
import pandas as pd
students = {
    "John": {
        "roll_number": 101,
        "cgpa": 3.5
    },
    "Jane": {
        "roll_number": 102,
        "cgpa": 3.8
    },
    "Bob": {
        "roll_number": 103,
        "cgpa": 3.2
    },
    "Alice": {
        "roll_number": 104,
        "cgpa": 3.7
    },
    "Mike": {
        "roll_number": 105,
        "cgpa": 3.9
    }
}
df = pd.DataFrame(students)
print(df)

              John   Jane    Bob  Alice   Mike
roll_number  101.0  102.0  103.0  104.0  105.0
cgpa           3.5    3.8    3.2    3.7    3.9

In [16]:
import pandas as pd

students = {
    'Roll No.': [101, 102, 103, 104, 105],
    'CGPA': [3.7, 3.5, 3.9, 3.2, 3.6]
}

df = pd.DataFrame(students)

print(df)
dir(pd)

   Roll No.  CGPA
0       101   3.7
1       102   3.5
2       103   3.9
3       104   3.2
4       105   3.6

['BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__all__',
 '__builtins__',
 '__cached__',
 '__deprecated_num_index_names',
 '__dir__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_is_numpy_dev',
 '_libs',
 '_testing',
 '_typing',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [34]:
import pandas as pd

df = pd.read_csv("Salaries.csv")
print(df.shape)

(78, 6)

In [36]:
df

         rank discipline   phd  service     sex    salary
0        Prof          B  56.0       49    Male  186960.0
1        Prof          A  12.0        6    Male   93000.0
2        Prof          A  23.0       20    Male  110515.0
3        Prof          A  40.0       31    Male  131205.0
4        Prof          B  20.0       18    Male  104800.0
..        ...        ...   ...      ...     ...       ...
73       Prof          B  18.0       10  Female  105450.0
74  AssocProf          B  19.0        6  Female  104542.0
75       Prof          B  17.0       17  Female  124312.0
76       Prof          A  28.0       14  Female  109954.0
77       Prof          A  23.0       15  Female  109646.0

[78 rows x 6 columns]

In [35]:
df.head()

   rank discipline   phd  service   sex    salary
0  Prof          B  56.0       49  Male  186960.0
1  Prof          A  12.0        6  Male   93000.0
2  Prof          A  23.0       20  Male  110515.0
3  Prof          A  40.0       31  Male  131205.0
4  Prof          B  20.0       18  Male  104800.0

In [ ]:
#display any row randomly

In [39]:
df.sample()

    rank discipline   phd  service   sex    salary
35  Prof          B  28.0       23  Male  126933.0

In [46]:
df.columns.tolist()

['rank', 'discipline', 'phd', 'service', 'sex', 'salary']

In [ ]:
# display any single row

In [55]:
df['discipline']

0     B
1     A
2     A
3     A
4     B
     ..
73    B
74    B
75    B
76    A
77    A
Name: discipline, Length: 78, dtype: object